export type One = "🂡" | "🂱" | "🃁" | "🃑";
export type Two = "🂢" | "🂲" | "🃂" | "🃒";
export type Three = "🂣" | "🂳" | "🃃" | "🃔";
export type Four = "🂤" | "🂴" | "🃄" | "🃕";
export type Five = "🂥" | "🂵" | "🃅" | "🃖";
export type Six = "🂦" | "🂶" | "🃆" | "🃗";
export type Seven = "🂧" | "🂷" | "🃇" | "🃘";
export type Eight = "🂨" | "🂸" | "🃉" | "🃛";
export type Nine = "🂩" | "🂹" | "🃊" | "🃜";
export type Ten = "🂪" | "🂺" | "🃋" | "🃝";
export type Jack = "🂫" | "🂻" | "🃍" | "🃞";
export type Queen = "🂭" | "🂼" | "🃎" | "🃟";
export type King = "🂮" | "🂽" | "🃍" | "🃠";

export type Spades =
	| "🂡"
	| "🂢"
	| "🂣"
	| "🂤"
	| "🂥"
	| "🂦"
	| "🂧"
	| "🂨"
	| "🂩"
	| "🂪"
	| "🂫"
	| "🂬"
	| "🂭"
	| "🂮";
export type Hearts =
	| "🂱"
	| "🂲"
	| "🂳"
	| "🂴"
	| "🂵"
	| "🂶"
	| "🂷"
	| "🂸"
	| "🂹"
	| "🂺"
	| "🂻"
	| "🂼"
	| "🂽"
	| "🂾";
export type Diamonds =
	| "🃁"
	| "🃂"
	| "🃃"
	| "🃄"
	| "🃅"
	| "🃆"
	| "🃇"
	| "🃈"
	| "🃉"
	| "🃊"
	| "🃋"
	| "🃌"
	| "🃍"
	| "🃎";
export type Clubs =
	| "🃑"
	| "🃒"
	| "🃓"
	| "🃔"
	| "🃕"
	| "🃖"
	| "🃗"
	| "🃘"
	| "🃙"
	| "🃚"
	| "🃛"
	| "🃜"
	| "🃝"
	| "🃞";

export type Card = Spades | Hearts | Diamonds | Clubs;
